test/src/test/testtool/SoapValidator/Items/item-ok-in-soap.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<Item_Request xmlns="urn:items">
			<Status>a</Status>
			<Item>
				<Id>1</Id>
			</Item>
		</Item_Request>
	</soapenv:Body>
</soapenv:Envelope>
